<template>
<el-row>
    <el-col :span="16"><div class="grid-content ep-bg-purple" />

    </el-col>
    <el-col :span="8"><div class="grid-content ep-bg-purple-light" />
        <h4>深圳市，简称“深”，别称鹏城。</h4>
        <el-divider />
        <span>深圳市是中国广东省辖地级市，国家计划单列市，超大城市，国务院批复确定的经济特区、全国性经济中心城市   和国家创新型城市，粤港澳大湾区核心引擎城市之一  。截至2022年,全市下辖9个区,总面积1997.47平方千米,常住人口1768.16万人  。
深圳市地处广东省南部，珠江口东岸，东临大亚湾和大鹏湾，西濒珠江口和伶仃洋，南与香港相连，北部与东莞、惠州接壤。位于北回归线以南，属亚热带季风气候，温润宜人，降水丰富  。</span>
<el-divider />        
<span>
            深圳市是粤港澳大湾区四大中心城市之一、国家物流枢纽、国际性综合交通枢纽  、国际科技产业创新中心  、中国三大全国性金融中心之一，并全力建设中国特色社会主义先行示范区  、综合性国家科学中心 和全球海洋中心城市  。
</span>
<el-divider />    
<span>
            深圳前身为广州府宝安县（新安县），建市之前属惠阳地区 。深圳之名始见史籍于明朝永乐八年(1410年),1979年,成立深圳市,1980年,成为中国设立的第一个经济特区，中国改革开放的窗口和新兴移民城市，创造了举世瞩目的“深圳速度”，被誉为“中国硅谷” 。
2022年,深圳市实现地区生产总值32387.68亿元,比上年增长3.3%  。
        </span>
        
    </el-col>
  </el-row>

</template>

<script>



</script>
