<template>
  <el-row>
    <el-col :span="1"/>
    <el-col :span="22" style="height: 100%;">
      <el-row>
        <el-col :span="11" style="height: 100%;">
          <el-card style="border-radius: 20px;height: 400px;">
            <template #header>
              <h2>研究概述</h2>
            </template>
            <el-text style="font-size: 16px;" >
              随着城市人口规模的增加，通过私家车出行的体验在不断变差，环境危害也越来越严重。以共享单车和传统公共交通为主的低碳出行方式成为更多居民的偏爱。如何利用共享单车强流动性的特点，提升居民低碳出行体验，是值得研究的重要问题。本课题将结合摩拜单车数据与传统公共交通数据，构建更优的共享单车投放点选择模型，并通过优化过的灰狼算法求解，得到不同场景下共享单车最佳投放位置。在此基础上，预估单车使用需求变化，结合遗传算法求解得到高效调度方案，构建出一个循环良好的城市绿色低碳出行网络。
            </el-text>
          </el-card>
        </el-col>
        <el-col :span="1"/>
        <el-col :span="12" style="height: 100%;">
          <el-card style="border-radius: 20px;height: 400px;">
            <template #header>
              <h2>研究背景</h2>
            </template>
            <div>

            <el-text style="font-size: 16px;" type="info">
              共享单车作为一种新兴的交通工具，它改善了传统自行车不便于存取，使用场景受限等缺点，更加符合现代人的出行习惯。单车出行不仅有益于身心健康，减小人体突发疾病的概率，还可以减少温室气体和有害尾气的排放和降低社会医疗成本。发展共享单车可以提高居民短途出行效率，优化城市居民生活体验。研究共享单车的时空分布，优化单车投放位置与不平衡条件下的调度策略，是提高共享单车利用率的重要途径之一。

            </el-text>

            </div>
            <div>
            <el-text style="font-size: 16px;" type="info">
              传统公共交通是城市运转不可或缺的部分，是城市低碳出行的重要组成。如今，公交车和地铁等作为了传统公共交通主要组成部分。相较大多数以石油为能源的私家车出行，传统公共交通对环境危害更小，更有利于城市可持续发展。但由于线路更改难度大等问题，市民在传统公共交通上的出行体验仍受限于交通站点固定的问题。利用共享单车的流动性，弥补交通站点固定带来的缺点是提升传统公共交通出行体验的重要方法。

            </el-text>
            </div>
          </el-card>
        </el-col>
      </el-row>


      <el-divider/>
      <el-card style="border-radius: 20px;height: 350px;">
        <template #header>
          <h2>研究内容</h2>
        </template>
        <div>
          <el-text style="font-size: 16px;">
            随着我国城市规模的增大和人口增加，以公共交通为首的低碳出行方式在市区内的体验逐渐优于传统机动车出行，引导居民绿色出行是提高居民生活体验的有效途径。针对当前共享单车投放与调度问题上，很少将城市内现有的传统公共设施结合起来的现状，本课题基于已有的摩拜单车行车数据和传统公共交通站点数据，利用时空分析，计算机科学，智能算法等方法对共享单车投放与调度问题展开研究，我们小组拟进行如下研究：
          </el-text>
        </div>
        <div>
          <el-text style="font-size: 16px;">
            （1）	城市内居民单车出行模式和偏好
            本研究将针对已有的摩拜单车出行数据，结合对应城市的路网数据和POI数据，从时间和空间两个维度，对当前城市居民的出行特征进行分析。首先得出该市居民的出行偏好，然后将出行数据按工作日和非工作日分类，分别采用非负矩阵分解算法（NMF），解析出对应条件下居民出行模式，为优化单车投放和调度策略提供支撑。
          </el-text>
        </div>

        <div>
          <el-text style="font-size: 16px;">

            （2）	结合传统公共交通布局优化单车投放点选址
            为了能将传统公共交通与共享单车出行方式相结合，吸引居民参与低碳出行。本研究基于摩拜单车行车数据和公交站点，地铁站点等位置信息，构建优化单车投放点模型。通过引入智能算法中的灰狼算法进行求解，得到优化后的共享单车投放点选择，扩展城市低碳出行的可达性。
          </el-text>
        </div>
        <div>
          <el-text style="font-size: 16px;">
            （3）	基于优化后的投放点选择，预测单车需求量变化，
            在得到优化后的投放点选择的基础上，通过引入神经网络模型，预测在该投放模型下用户需求量变化。得到可靠的需求预测后，对地块单车需求量进行预测。

          </el-text>
        </div>
      </el-card>

    </el-col>
    <el-col :span="1"/>
  </el-row>
</template>

<script>
export default {
  name: "SearchContent"
}
</script>

<style scoped>

</style>